<?php
	/*
	 * Форматирование даты и времени в PHP
	 */
	
	date_default_timezone_set('Asia/Shanghai');
	
	// ⊗ppPmTmFm
	
	/* ------------- №1 ------------- */
	echo date('Y') . ' ';
	echo date('m') . ' ';
	echo date('d') . ' ';
	echo date('H') . ' ';
	echo date('i') . ' ';
	echo date('s') . ' ' . PHP_EOL;
	
	/* ------------- №2 ------------- */
	echo date('Y-m-d') . PHP_EOL;
	
	/* ------------- №3 ------------- */
	echo date('d-m-Y') . PHP_EOL;
	
	/* ------------- №4 ------------- */
	echo date('d.m.Y H:i:s') . PHP_EOL;
	
	/* ------------- №5 ------------- */
	echo date('d.m.Y', mktime(0, 0, 0, 2, 12, 2025)) . PHP_EOL;
	
	/* ------------- №6 ------------- */
	$days = ['воскресенье', 'понедельник','вторник','среда','четверг','пятница','суббота'];
	echo $days[date('w')] . PHP_EOL;
	
	/* ------------- №7 ------------- */
	$months = [
		1 => 'январь',
		2 => 'февраль',
		3 => 'март',
		4 => 'апрель',
		5 => 'май',
		6 => 'июнь',
		7 => 'июль',
		8 => 'август',
		9 => 'сентябрь',
		10 => 'октябрь',
		11 => 'ноябрь',
		12 => 'декабрь'
	];
	echo $months[date('n')] . PHP_EOL;
	
	/* ------------- №8 ------------- */
	echo date('t');
	
	
	