<?php
	/*
	 * Просмотр вперед в регулярках PHP (Lookaheads)
	 * Позитивный просмотр вперед - (?= )
	 * негативный просмотр вперед - (?!)
	 */

	// ⊗ppPmRgVA
	
	/* ------------- №1 ------------- */
	$str = 'func1() func2() func3()';
	
	$reg = '#\w+(?=\(\))#';
	
	preg_match_all($reg, $str, $res);
	
	print_r($res);
	
	/* ------------- №2 ------------- */
	$str = '<a href="" class="eee" id="zzz">';
	
	$reg = '#\s\w+(?==".*?")#';
	
	preg_match_all($reg, $str, $res);
	
	print_r($res);
	
	/* ------------- №3 ------------- */
	// Позитивный просмотр вперед
	
	$str = 'Цена: 15$ и 20 евро, а также 50$';
	
	$reg = '#\d+(?=\$)#';
	
	preg_match_all($reg, $str, $res);
	
	print_r($res);
	
	/* ------------- №4 ------------- */
	// Негативный просмотр вперед

	$reg = '#\d{2}(?!\$)#'; // НЕ следует знак доллара ($)
	
	preg_match_all($reg, $str, $res);
	
	print_r($res);
	
	/* ------------- №5 ------------- */
	// Позитивный просмотр назад (?<=...)
	
	$str = 'a_b-c-d_e-f';
	
	$reg = '#(?<=-)[a-z]#';
	
	preg_match_all($reg, $str, $res);
	
	print_r($res);

