<?php
	/*
	 * Диапазон в массив в PHP
	 */

	// ⊗ppPmAFRg
	
	/* ------------- №1 ------------- */
	var_dump(range(1, 100));
	
	/* ------------- №2 ------------- */
	var_dump(range('a', 'z'));
	
	/* ------------- №3 ------------- */
	$arr = range(1, 9);
	printf('%d-%d-%d-%d-%d-%d-%d-%d-%d', ...$arr);
	
	/* ------------- №4 ------------- */
	$n = 100;
	echo $n * (1 + $n) / 2 . PHP_EOL;
	
	/* ------------- №5 ------------- */
	$num = range(1, 10);
	printf('%d·%d·%d·%d·%d·%d·%d·%d·%d·%d = %d', ...$num);
