<?php
	/*
	 * Заполнение многомерных массивов PHP
	 */

	// ⊗ppPmMdFl
	
	/* ---------- №1 ---------- */
	
	$arr = [];
	
	for ($i = 0; $i < 3; $i++) {
		for ($j = 0; $j < 5; $j++) {
			$arr[$i][$j] = $j + 1;
		}
	}
	
	var_dump($arr);
	
	/* ---------- №2 ---------- */

	$arr = [];
	
	for ($i = 0; $i < 3; $i++) {
		for ($j = 0; $j < 4; $j++) {
			$arr[$i][$j] = 'x';
		}
	}
	
	var_dump($arr);
	
	/* ---------- №3 ---------- */
	
	$arr = [];
	
	for ($i = 0; $i < 3; $i++) {
		for ($j = 0; $j < 2; $j++) {
			for ($k = 0; $k < 5; $k++) {
				$arr[$i][$j][$k] = $k + 1;
			}
		}
	}
	
	var_dump($arr);